 {
  "description_sections": {
    "Responsibilities": [
      "Lead and participate in software change control boards to manage updates and modifications.",
      "Analyze and assess proposed software design changes, ensuring alignment with hardware functionality and system integrity.",
      "Perform comprehensive audits of software systems and development processes, collaborating with prime contractors to ensure regulatory and contractual compliance.",
      "Validate and implement revised software designs, ensuring they meet engineering and quality benchmarks.",
      "Manage the software auditing process, ensuring all updates are thoroughly reviewed and meet established standards.",
      "Contribute to regular team meetings, offering insights into process improvements and procedural enhancements.",
      "Maintain objectivity when evaluating software systems and their compliance with project requirements.",
      "Ensure rigorous testing protocols are followed and that software meets all engineering and performance criteria."
    ],
    "Requirements": [
      "5+ years of experience in software engineering, including design, testing, and lifecycle management",
      "Solid grasp of agile methodologies and project management frameworks",
      "Proficiency in both C++ and Python programming languages",
      "Experience working with embedded software platforms",
      "Advanced proficiency in Microsoft Office tools (Excel, Word, PowerPoint)",
      "Willingness to travel up to 25% for critical project needs",
      "Strong customer orientation and collaborative mindset",
      "Demonstrated experience in defense or military-related software projects",
      "Expertise in software oversight, auditing, and lifecycle governance rather than active coding",
      "Familiarity with software engineering design and change control procedures",
      "Active Top-Secret Security Clearance",
      "Bachelor’s degree in Engineering or equivalent professional experience"
    ],
    "NiceToHaves": [
      "No information provided"
    ],
    "Benefits": [
      "Salary: $140,000-$180,000 (based on relevant experience)",
      "Comprehensive Benefits: Medical, Dental, Vision, 401K, PTO, Holidays, Sick Leave as required by law"
    ]
  }
}