 {
  "description_sections": {
    "Responsibilities": [
      "Lead daily, weekly, and monthly operational reviews with internal teams and client representatives.",
      "Serves as the primary point of contact for CBP stakeholders, program leadership, and technical teams regarding project performance, reporting, and escalations.",
      "Monitor and analyze performance data, ticket resolution metrics, and call center KPIs to identify trends and areas of improvement.",
      "Conduct quality audits of service desk interactions (Calls, Tickets, chats) to ensure adherence to SOPs and customer standards.",
      "Provide feedback and training recommendations to supervisors and agents to improve performance.",
      "Lead root cause analysis (RCA) and continuous recurring issues.",
      "Delivering effective Standard Operating Procedures (SOPs), performance reports, and other deliverables accurately and on time.",
      "Reviewing and responding to customer feedback—including from customer satisfaction surveys and from customers reaching out directly to TSD—and apply that feedback to continuous improvement initiatives."
    ],
    "Requirements": [
      "A minimum of three (3) years of experience performing quality control duties in any field",
      "In depth knowledge of service desk best practices",
      "Three (3) years of project management experience, preferably supporting the federal government",
      "Active DoD Secret Clearance",
      "Experience: quality control: 3 years (Required)",
      "Experience: service desk best practices: 2 years (Required)",
      "Experience: supporting the federal government: 2 years (Preferred)",
      "Security clearance: Secret (Required)",
      "Ability to Commute: Ashburn, VA 20147 (Required)",
      "Ability to Relocate: Ashburn, VA 20147: Relocate before starting work (Required)"
    ],
    "NiceToHaves": [
      "Willingness to travel: 25% (Required)"
    ],
    "Benefits": [
      "401(k)",
      "401(k) matching",
      "Dental insurance",
      "Employee assistance program",
      "Health insurance",
      "Life insurance",
      "Paid time off",
      "Professional development assistance",
      "Vision insurance"
    ]
  }
}