 {
  "description_sections": {
    "Responsibilities": [
      "Support the development and execution of global benefits strategies and programs across multiple regions.",
      "Collaborate with the VP, Global Rewards to align program design with GitHub’s Total Rewards philosophy.",
      "Manage vendor relationships, including performance monitoring, issue resolution, and contract renewals.",
      "Lead the implementation of new benefits initiatives and enhancements to existing programs.",
      "Ensure compliance with local regulations and internal policies; partner with Legal and Finance as needed.",
      "Analyze benefits data and market trends to inform recommendations and continuous improvement.",
      "Collaborate across the People team to deliver benefits education and support to employees and managers and Global TA.",
      "Mentor and guide team members, fostering a culture of collaboration and continuous learning."
    ],
    "Requirements": [
      "8+ years experience in human resources, benefits, or related field",
      "Bachelor's Degree in Human Resources, Business, Social Sciences, or related field AND 6+ years experience in human resources, benefits, or related field",
      "OR equivalent experience.",
      "2+ years of experience in people management or team leadership.",
      "Experience managing global benefits programs across multiple geographies.",
      "Experience operating in a global, remote environment."
    ],
    "NiceToHaves": [
      "Ability to work effectively in a fast-paced, dynamic environment with cross-functional teams.",
      "Experience partnering with workers’ councils to support benefits program design, implementation, and compliance across international regions.",
      "Skilled in crafting executive-ready materials and delivering concise, high-impact presentations under tight time constraints",
      "Player-coach mindset: leads strategically while diving into hands-on execution",
      "Enthusiastic about leveraging agentic AI to personalize and streamline employee benefits, with a strong curiosity for emerging AI technologies and trends.",
      "Strong analytical, communication, and project management skills."
    ],
    "Benefits": [
      "Compensation Range: The base salary range for this job is USD $96,400.00 - USD $255,700.00 /Yr.",
      "At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock.",
      "GitHub offers competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are."
    ]
  }
}