 {
  "description_sections": {
    "Responsibilities": [
      "Working closely with the Product Owner to understand business value and collaborating with a team to translate these needs into working software.",
      "Working closely with the Scrum Master to improve team performance and consistently deliver quality software on time and within budget.",
      "Operating within an Agile software development environment.",
      "Estimating and planning work items, providing input on requirements and UI/UX designs, developing and testing web-applications, participating in release activities, and customer support and troubleshooting.",
      "Striving to improve oneself, team, and process through daily teamwork, communication, idea-sharing, collaboration and problem-solving.",
      "Recommending innovative solutions to deliver a better end product.",
      "Performing other responsibilities as needed to ensure customer and team success."
    ],
    "Requirements": [
      "3+ years of professional experience in software development and a technical Bachelors Degree.",
      "Knowledge developing web applications using .NET/C#, HTML, CSS, JavaScript/jQuery or similar languages.",
      "Knowledge with SQL Server (or equivalent) and database development.",
      "Knowledge working in multi-developer teams and with source code control processes.",
      "Understanding of Object-Oriented principles and classical design patterns.",
      "Ability to work independently and as part of a team on multiple tasks using Agile Scrum.",
      "Strong professional and interpersonal skills with emphasis on self-initiation, teamwork and follow through.",
      "Effective verbal and written communication skills.",
      "Positive customer service attitude.",
      "Ability to obtain a Public Trust Clearance.",
      "U.s. citizen or green card permanent resident (3+ years U.S residency required)."
    ],
    "NiceToHaves": [
      "Portfolio demonstrating examples of previous work preferred.",
      "Experience working with MVC frameworks.",
      "Experience in creating and/or consuming web services.",
      "Experience developing applications using JavaScript frameworks (angular.js, backbone.js, etc.).",
      "Experience with data visualization and analysis.",
      "Interest in research and keeping up with current technology trends.",
      "Ability to support multiple projects.",
      "Experience in integrating with third party applications.",
      "Experience developing for mobile platforms.",
      "Experience with Agile processes.",
      "Federal Aviation Administration Experience."
    ],
    "Benefits": [
      "Remote/hybrid status is subject to change based on Noblis and/or government requirements",
      "Commitment to Non-Discrimination",
      "EEO is the Law | E-Verify | Right to Work",
      "Total Rewards",
      "Compensation at Noblis is determined by various factors, including but not limited to, the combination of education, certifications, knowledge, skills, competencies, and experience, internal and external equity, location, clearance level, as well as contract-specific affordability, organizational requirements and applicable employment laws. The projected compensation range for this position is based on full time status.",
      "Posted Salary Range: USD $77,000.00 - USD $120,275.00 /Yr."
    ]
  }
}