 {
  "description_sections": {
    "Responsibilities": [
      "Drive clarity and manage projects across multiple teams, fostering clear communication, understanding, and process improvements.",
      "Coach, mentor, manage, and advocate for the career development of the teams.",
      "Cultivate team morale and culture, and partner with leadership to implement strategies and initiatives",
      "Drive operational excellence and long term technical thinking/strategy.",
      "Build strategic relationships with public and private sector entities to better identify and track threats to GitHub and our customers.",
      "Develop and maintain a portfolio of threat profiles, activity, and trends that threaten GitHub, its customers, employees, and infrastructure from several sources.",
      "Partner with GitHub’s engineering organization to champion the resolution of red team findings.",
      "Communicate security control gaps, risks, and other threats to GitHub to our executive leadership team."
    ],
    "Requirements": [
      "3+ years of people management experience.",
      "3+ years of experience in a cyber threat intelligence or similar role.",
      "Familiarity or experience in red team or adversarial emulation operations.",
      "8+ years in a security related role."
    ],
    "NiceToHaves": [
      "Experience developing a strategy and roadmap for teams.",
      "Strong track record of managing performance, calibrating expectations, and building and maintaining high performing, inclusive teams.",
      "Strong written and verbal communication skills, attention to detail, planning, and organization.",
      "Ability to understand, summarize and communicate highly technical information, in an accessible way, to executives and partners.",
      "Experience using Git and GitHub and understanding of the open source ecosystem",
      "Understanding of the unique security risks of cloud computing platforms including Azure and AWS"
    ],
    "Benefits": [
      "Minimum salary of $118,100 to maximum $313,300.",
      "In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role.",
      "Certain roles are eligible for benefits and additional rewards, including annual bonus and stock.",
      "Location: In this role, you can work remotely from anywhere in the United States."
    ]
  }
}