 {
  "description_sections": {
    "Responsibilities": [
      "Educates uninsured health center patients and community members about the Affordable Care Act and health insurance options through the HBE.",
      "Explains affordability programs, Medicaid and DC Healthcare Alliance, qualified Health Plans, Essential Health Benefits, and rights when using insurance.",
      "Assists with opening or accessing an account with the HBE.",
      "Assists patients with application and determining eligibility for premium tax credits and Medicaid.",
      "Ensures that patients understand their health plan options and utilize the web-based decision tools to help narrow the choices for qualified health plans.",
      "Makes referrals as needed to the DC Alliance, a broker, the Exchange, or government and community resources as needed.",
      "Explains to patients when life changes can be reported and renewal will be needed.",
      "Works collaboratively with Unity administrators, providers, nursing and social service staff to identify uninsured patients and community members.",
      "Participates in agency and citywide outreach events to educate the community and assist with insurance enrollment.",
      "Provides all services in a professional and confidential manner.",
      "Accurately tracks and records activities for reporting to the HBE.",
      "Provides an overview of available Unity Health Care (UHC) services, how to select a PCP, schedule appointments, etc.",
      "Accurately completes applications within required time frame.",
      "Submits clear and accurate data collection forms for all work performed as required by agency, department or grant.",
      "Attends departmental, health center, site visits, required network events and mandatory trainings and meetings.",
      "Performs other duties as assigned."
    ],
    "Requirements": [
      "Associate's degree; Bachelor's preferred.",
      "One year experience with insurance or medical front office and/or community outreach and engagement preferred.",
      "Strong customer service skills.",
      "Ability to utilize the internet and navigate the online portal.",
      "Ability to organize information and enter data for reporting purposes.",
      "Basic knowledge of health insurance and health service delivery.",
      "Ability to recognize cultural, language, and learning differences.",
      "Ability to explain and summarize detailed and complex concepts.",
      "Experience working with people in a one-on-one setting to provide education about public or private health programs helpful."
    ],
    "NiceToHaves": ["No information provided."],
    "Benefits": [
      "Health insurance"
    ]
  }
}