 {
  "description_sections": {
    "Responsibilities": [
      "Leadership: Demonstrate strong sales leadership skills as part of a team of Enterprise Solutions Sales (ESS).",
      "Business Development: Be part of a team that is focused on exceeding aggressive sales targets.",
      "Territory Planning & Program Implementation: Develop regional territory plans to capture the revenue opportunity for GitHub products and services.",
      "Network Building: Identify the right Microsoft stakeholders and build connections quickly to drive consensus for joint sales motions and for deals.",
      "Risk Management: Identify account, territory and program risk and be decisive to ensure any risk is mitigated.",
      "Effective Communicator & Presenter: Present strategic ideas to small and large groups that will include customers and Microsoft sales teams.",
      "Problem Solver: Solve problems and hypothesize possible selling pain points, expectations, and implicit needs.",
      "Understand GitHub Products and Solutions: Understand how we enable customers to be successful with our products and services",
    ],
    "Requirements": [
      "7+ years experience in Alliance Management, sales, business development, go-to-market, or partner channel development in the technology industry or related experience",
      "OR Bachelor's Degree in Marketing, Business Operations, Computer Science or related field AND 5+ years experience in Alliance Management, sales, business development, or partner channel development in the technology industry or related experience",
      "OR Master's Degree in Marketing, Business Operations, Computer Science or related field AND 3+ years experience in Alliance Management, sales, business development, or partner channel development in the technology industry or related experience",
      "OR equivalent experience.",
      "2+ years experience co-selling with, through, or into Microsoft’s field sales organizations.",
      "Ability to travel up to 25% when needed."
    ],
    "NiceToHaves": [
      "Direct experience with co-selling with, through, or into GitHub’s field sales organizations.",
      "Experience defining, piloting, incubating, implementing and scaling programmatic sales programs in the field.",
      "Successful management of large-scale complex deal cycles in large enterprise accounts for Application Development, Cloud Deployment services, or DevSecOps offerings.",
      "Strong relationship building and deal structuring skills for both consumption and subscription based software products.",
      "Executive level communication and presentation skills (both written and verbal), with the ability to mentor others."
    ],
    "Benefits": [
      "Compensation Range: The base salary range for this job is USD $75,420.00 - USD $200,100.00 /Yr.",
      "In addition, this role also has the opportunity to earn sales incentives. On target earnings (OTE) is based on a 60/40 base salary/sales incentive.",
      "GitHub Leadership Principles: GitHub values customer-obsessed, ship to learn, growth mindset, own the outcome, better together, diverse and inclusive.",
      "Manager fundamentals: Model, Coach, Care",
      "Leadership principles: Create clarity, Generate energy, Deliver success"
    ]
  }
}