 {
  "description_sections": {
    "Responsibilities": [
      "Design, develop, test and maintain high-performance, scalable backend microservices using Java and the Spring Framework.",
      "Participates in software programming initiatives, shaping backend architecture, and code reviews.",
      "Develops software system validation and testing methods using Junit and Katalon.",
      "Develops, prototypes and deploys solutions within a cloud-based platform leveraging platform services.",
      "Support the Agile software development lifecycle following Program SAFe practices while coordinating closely with team members, Product Owners and Scrum Masters to ensure User Story alignment and implementation to customer use cases.",
      "Document and perform systems software development, including deployment of build artifacts across different environments leveraging GitFlow constructs and using industry leading DevOps tools like GitHub, Jenkins, and scripting (e.g., python, bash).",
      "Apply and identify software development best practices and standard operating procedures creating innovative solutions to meet the technical needs of customers."
    ],
    "Requirements": [
      "Familiarity with common Agile practices, service-orientated environments, and development practices.",
      "Familiarity with Java and the Spring Framework, microservices architecture and design patterns, implementing RESTful APIs, and integrating with relational and NoSQL databases.",
      "Familiarity with integrating with and delivering within DevOps toolsets/practices.",
      "Direct experience utilizing software testing performance tools, such as Junit and scripting languages, such as Python, and Bash while working in an Agile development environment.",
      "Familiarity with with development in Commercial Cloud Platforms (ex, AWS, Google Cloud, Azure) and leveraging cloud data services (ex: S3, RDS, EFS).",
      "Familiarity with using version control systems and issue/problem tracking systems.",
      "Bachelor’s degree with 4 or more years of prior relevant experience or Master’s degree with 2 or more years of relevant experience. Will consider experience in lieu of a degree.",
      "To be considered must have an active TS/SCI with polygraph security clearance"
    ],
    "NiceToHaves": [
      "Experience with SAFe development practices"
    ],
    "Benefits": [
      "Competitive benefits, including Paid Time Off, 11 paid Holidays, 401K with a 6% company match and immediate vesting, Flexible Schedules, Discounted Stock Purchase Plans, Technical Upskilling, Education and Training Support, Parental Paid Leave, and much more."
    ]
  }
}