 {
  "description_sections": {
    "Responsibilities": [
      "Identifies key prospects by assessing customer needs and delivering tailored value propositions",
      "Qualifies opportunities and contributes to account planning with sales representatives",
      "Engages with customers and partners to align on needs and desired outcomes with the GitHub platform",
      "Assesses market trends to uncover new opportunities for GitHub’s products and platform",
      "Supports and executes account strategies to meet business goals",
      "Expands customer engagement by identifying new strategic contacts and departments",
      "Builds strong customer relationships through clear communication and value articulation",
      "Interprets product usage and internal sales reporting to inform prospecting strategy, address customer questions, and achieve quota",
      "Drives continuous improvement by analyzing KPIs, learning from past engagements, and collaborating with peers. Contributes to strategic projects that enhance process efficiency and business outcomes."
    ],
    "Requirements": [
      "1+ year(s) of experience in business development or sales",
      "Work from the San Francisco or Bellevue office two days per week."
    ],
    "NiceToHaves": [
      "2+ years experience in business development or sales",
      "OR equivalent experience.",
      "1+ year(s) experience in computer science, software development, technology, or a related domain.",
      "Previous experience prospecting into enterprise accounts in a highly technical market",
      "Comfortable working in a fast-paced and dynamic environment",
      "Genuine interest in technology and ability to understand, distill and convey the value proposition of an Enterprise Platform",
      "Knowledge of Git and GitHub"
    ],
    "Benefits": [
      "The base salary range for this job is USD $21.50 - USD $30.57 /Hr.",
      "In addition, this role also has the opportunity to earn sales incentives. On target earnings (OTE) is based on a 65/35 base salary/sales incentive.",
      "GitHub values customer-obsessed, ship to learn, growth mindset, own the outcome, better together, diverse and inclusive",
      "GitHub offers competitive pay, generous learning and growth opportunities, and excellent benefits"
    ]
  }
}